[{"id":3,"name":"Galaxy S23 Ultra","description":"The Samsung Galaxy S23 Ultra features a 6.8-inch AMOLED display, a 200MP camera, and a Snapdragon 8 Gen 2 processor for superior performance.","price":1199,"categoryId":4},{"id":4,"name":"iPhone 15 Pro Max","description":"The iPhone 15 Pro Max boasts a 6.7-inch Super Retina XDR display, A17 Bionic chip, and advanced camera system with ProRAW capabilities.","price":1299,"categoryId":4},{"id":5,"name":"MacBook Pro 16-inch (2023)","description":"Powered by the M3 Max chip, the MacBook Pro offers a 16-inch Liquid Retina XDR display and up to 32 hours of battery life, ideal for professionals.","price":3499,"categoryId":5},{"id":6,"name":"Dell XPS 13","description":"The Dell XPS 13 is an ultra-slim laptop featuring a 13.4-inch InfinityEdge display, Intel Core i7 processor, and up to 1TB SSD storage for fast performance.","price":1299,"categoryId":5},{"id":7,"name":"Apple Watch Series 9","description":"Apple Watch Series 9 offers advanced health monitoring, crash detection, and precision finding with the new S9 chip for seamless performance.","price":499,"categoryId":6},{"id":8,"name":"Fitbit Charge 6","description":"The Fitbit Charge 6 comes with a heart rate monitor, GPS, and sleep tracking, along with a sleek design to support an active lifestyle.","price":179,"categoryId":6},{"id":9,"name":"iPad Pro 12.9-inch (2023)","description":"Featuring the M3 chip, the iPad Pro offers a 12.9-inch Liquid Retina XDR display with ProMotion technology, ideal for creatives and professionals.","price":1199,"categoryId":7},{"id":10,"name":"Kindle Paperwhite (2023)","description":"The Kindle Paperwhite is a waterproof eReader with a 6.8-inch display, adjustable warm light, and weeks of battery life, perfect for reading anywhere.","price":139,"categoryId":7},{"id":11,"name":"Google Nest Thermostat","description":" The Google Nest Thermostat automatically adjusts your home's temperature to save energy and integrates with Google Assistant for smart control.","price":129,"categoryId":8},{"id":12,"name":"Ring Video Doorbell 4","description":"The Ring Video Doorbell 4 features 1080p HD video, advanced motion detection, and two-way audio, providing enhanced security for your home.","price":199,"categoryId":8}]